app/Controllers/Admin.php

    public function index()
    {
        $cekproduk = $this->produk->countAllResults();
        $cekagen = $this->agen->countAllResults();
        $cekapis = $this->apis->countAllResults();
        $cekpesan = $this->kontak->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `produk`
SELECT COUNT(*) AS `numrows`
FROM `agen`
SELECT COUNT(*) AS `numrows`
FROM `kontak`

    public function produk()
    {
        $data['title'] = "Produk";
        $data['activeMenu'] = "produk";
        $data['produk'] = $this->produk->findAll();
---
SELECT *
FROM `produk`