app/Controllers/Agen.php

SELECT *
FROM `agen_report`
---
    public function report()
    {
        $title['title'] = "Laporan Penjualan";
        $menu['menu'] = "report";
        $email = session()->get('member_email');
        $report['report'] = $this->report->findAll();

SELECT *
FROM `agen_report`
---
    public function home()
    {
        $menu['menu'] = "home";
        $title['title'] = "Dashboard Agen";
        $email = session()->get('member_email');
        $report['report'] = $this->report->findAll();