app/Controllers/Login.php

SELECT *
FROM `profil`
---
    public function index()
    {
        $M_admin = new \App\Models\M_admin();
        $login = $this->request->getPost('login');
        $data['profil'] = $this->profil->findAll();