app/Controllers/Products.php

    public function show($id = null)
    {
        $model = new ProductModel();
        $data = $model->getWhere(['id_produk' => $id])->getResult();
---
SELECT *
FROM `produk`
WHERE `id_produk` = '2'