app/Controllers/Produk.php

SELECT *
FROM `produk`
---
    public function index()
    {
        $model = new M_produk();
        $data = $model->findAll();

SELECT *
FROM `produk`
WHERE `id_produk` = '12'
---
    public function show($id = null)
    {
        $model = new M_produk();
        $data = $model->getWhere(['id_produk' => $id])->getResult();