app/Models/M_auth.php

SELECT *
FROM `auth`
WHERE `email` = 'mohsyahri10@gmail.com'
 LIMIT 1
---
    function getEmail($email)
    {
        $builder = $this->table("auth");
        $data = $builder->where("email", $email)->first();