app/Models/M_token.php

SELECT *
FROM `token`
WHERE `id` = '1'
 LIMIT 1
---
    function getToken($id)
    {
        $builder = $this->table('token');
        $data = $builder->where('id', $id)->first();